Revit 2027 API
DeleteWorksetSettings.WorksetId Property
 The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId WorksetId { get; set; }
Public Property WorksetId As WorksetId
	Get
	Set
public:
property WorksetId^ WorksetId {
	WorksetId^ get ();
	void set (WorksetId^ value);
}
member WorksetId : WorksetId with get, set
Property Value
WorksetId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace